https://www.geeksforgeeks.org/pandas-groupby/

-------------------------------------------------------------------------------------------------------------------------------

Groupby mainly refers to a process involving one or more of the following steps they are:
    
    1. Splitting : It is a process in which we split data into group by applying some conditions on datasets.
    
    2. Applying : It is a process in which we apply a function to each group independently
    
           a. Aggregation
           
           b. Transformation
           
           c. Filtration
    
    3. Combining : We combine different datasets after applying groupby and results into a data structure

<h3 style="color:blue" align="left"> 1. Splitting Data into Groups </h3>

There are multiple ways to split data like:

       obj.groupby(key)
       
       obj.groupby(key, axis=1)
       
       obj.groupby([key1, key2])
       
       
  i) Grouping data with one key

 ii) Grouping data with multiple keys

iii) Grouping data by sorting keys

 iv) Grouping data with object attributes

In [2]:
# importing pandas module 
import pandas as pd

In [3]:
# Define a dictionary containing employee data  
data1 = {'Name':['Jai', 'Anuj', 'Jai', 'Princi',  
                 'Gaurav', 'Anuj', 'Princi', 'Abhi'],  
        'Age':[27, 24, 22, 32,  
               33, 36, 27, 32],  
        'Address':['Nagpur', 'Kanpur', 'Allahabad', 'Kannuaj', 
                   'Jaunpur', 'Kanpur', 'Allahabad', 'Aligarh'],  
        'Qualification':['Msc', 'MA', 'MCA', 'Phd', 
                         'B.Tech', 'B.com', 'Msc', 'MA']}

In [21]:
# Convert the dictionary into DataFrame   
df1 = pd.DataFrame(data1) 
   
print(df1)

     Name  Age    Address Qualification
0     Jai   27     Nagpur           Msc
1    Anuj   24     Kanpur            MA
2     Jai   22  Allahabad           MCA
3  Princi   32    Kannuaj           Phd
4  Gaurav   33    Jaunpur        B.Tech
5    Anuj   36     Kanpur         B.com
6  Princi   27  Allahabad           Msc
7    Abhi   32    Aligarh            MA

### i) Grouping data with one key:

In [22]:
# using groupby function with one key 
  
df1.groupby('Name') 
print(df1.groupby('Name').groups)

{'Abhi': Int64Index([7], dtype='int64'), 'Anuj': Int64Index([1, 5], dtype='int64'), 'Gaurav': Int64Index([4], dtype='int64'), 'Jai': Int64Index([0, 2], dtype='int64'), 'Princi': Int64Index([3, 6], dtype='int64')}

In [23]:
# Now we print the first entries in all the groups formed.
# applying groupby() function to group the data on Name value.  

gk = df1.groupby('Name')  
    
# Let's print the first entries in all the groups formed.  
gk.first()

        Age  Address Qualification
Name
Abhi     32  Aligarh            MA
Anuj     24   Kanpur            MA
Gaurav   33  Jaunpur        B.Tech
Jai      27   Nagpur           Msc
Princi   32  Kannuaj           Phd

### ii) Grouping data with multiple keys :

In [24]:
# Using multiple keys in groupby() function

df1.groupby(['Name', 'Qualification']) 
  
print(df1.groupby(['Name', 'Qualification']).groups)

{('Abhi', 'MA'): Int64Index([7], dtype='int64'), ('Anuj', 'B.com'): Int64Index([5], dtype='int64'), ('Anuj', 'MA'): Int64Index([1], dtype='int64'), ('Gaurav', 'B.Tech'): Int64Index([4], dtype='int64'), ('Jai', 'MCA'): Int64Index([2], dtype='int64'), ('Jai', 'Msc'): Int64Index([0], dtype='int64'), ('Princi', 'Msc'): Int64Index([6], dtype='int64'), ('Princi', 'Phd'): Int64Index([3], dtype='int64')}

In [25]:
df1.groupby(['Name', 'Qualification'])

In [26]:
gk1=df1.groupby(['Name', 'Qualification'])
gk1.first()

                      Age    Address
Name   Qualification
Abhi   MA              32    Aligarh
Anuj   B.com           36     Kanpur
       MA              24     Kanpur
Gaurav B.Tech          33    Jaunpur
Jai    MCA             22  Allahabad
       Msc             27     Nagpur
Princi Msc             27  Allahabad
       Phd             32    Kannuaj

### iii) Grouping data by sorting keys :

# Group keys are sorted by default uring the groupby operation. User can pass sort=False for potential speedups.

In [12]:
# Define a dictionary containing employee data

data2 = {'Name':['Jai', 'Anuj', 'Jai', 'Princi',  
                 'Gaurav', 'Anuj', 'Princi', 'Abhi'],  
        'Age':[27, 24, 22, 32,  
               33, 36, 27, 32], }

In [27]:
# Convert the dictionary into DataFrame   
df2 = pd.DataFrame(data2) 
   
print(df2)

     Name  Age
0     Jai   27
1    Anuj   24
2     Jai   22
3  Princi   32
4  Gaurav   33
5    Anuj   36
6  Princi   27
7    Abhi   32

In [28]:
# using groupby function without using sort 
  
df2.groupby(['Name']).sum()

        Age
Name
Abhi     32
Anuj     60
Gaurav   33
Jai      49
Princi   59

In [29]:
# using groupby function with sort 
  
df2.groupby(['Name'], sort = False).sum()

        Age
Name
Jai      49
Anuj     60
Princi   59
Gaurav   33
Abhi     32

### iv) Grouping data with object attributes :

In [30]:
# using keys for grouping data 
  
df1.groupby('Name').groups

{'Abhi': Int64Index([7], dtype='int64'),
 'Anuj': Int64Index([1, 5], dtype='int64'),
 'Gaurav': Int64Index([4], dtype='int64'),
 'Jai': Int64Index([0, 2], dtype='int64'),
 'Princi': Int64Index([3, 6], dtype='int64')}

### Iterating through groups

In [33]:
# iterating an element of group 
  
grp = df1.groupby('Name') 
for name, group in grp: 
    print(name) 
    print(group) 
    print()

Abhi
   Name  Age  Address Qualification
7  Abhi   32  Aligarh            MA

Anuj
   Name  Age Address Qualification
1  Anuj   24  Kanpur            MA
5  Anuj   36  Kanpur         B.com

Gaurav
     Name  Age  Address Qualification
4  Gaurav   33  Jaunpur        B.Tech

Jai
  Name  Age    Address Qualification
0  Jai   27     Nagpur           Msc
2  Jai   22  Allahabad           MCA

Princi
     Name  Age    Address Qualification
3  Princi   32    Kannuaj           Phd
6  Princi   27  Allahabad           Msc

In [34]:
# iterating an element of group containing multiple keys 
  
grp1 = df1.groupby(['Name', 'Qualification']) 
for name, group in grp1: 
    print(name) 
    print(group) 
    print()

('Abhi', 'MA')
   Name  Age  Address Qualification
7  Abhi   32  Aligarh            MA

('Anuj', 'B.com')
   Name  Age Address Qualification
5  Anuj   36  Kanpur         B.com

('Anuj', 'MA')
   Name  Age Address Qualification
1  Anuj   24  Kanpur            MA

('Gaurav', 'B.Tech')
     Name  Age  Address Qualification
4  Gaurav   33  Jaunpur        B.Tech

('Jai', 'MCA')
  Name  Age    Address Qualification
2  Jai   22  Allahabad           MCA

('Jai', 'Msc')
  Name  Age Address Qualification
0  Jai   27  Nagpur           Msc

('Princi', 'Msc')
     Name  Age    Address Qualification
6  Princi   27  Allahabad           Msc

('Princi', 'Phd')
     Name  Age  Address Qualification
3  Princi   32  Kannuaj           Phd

### Selecting a groups

In [35]:
# selecting a single group 
  
grp = df1.groupby('Name') 
grp.get_group('Jai')

  Name  Age    Address Qualification
0  Jai   27     Nagpur           Msc
2  Jai   22  Allahabad           MCA

In [37]:
# selecting object grouped on multiple columns 
  
grp1 = df1.groupby(['Name', 'Qualification']) 
grp1.get_group(('Jai', 'Msc'))

  Name  Age Address Qualification
0  Jai   27  Nagpur           Msc

<h3 style="color:blue" align="left"> 2. Applying function to group </h3>

After splitting a data into a group, we apply a function to each group in order to do that we perform some operation they are:


    a. Aggregation      :   It is a process in which we compute a summary statistic (or statistics) about each group. 
    
                            Aggregated function returns a single aggregated value for each group
    
                            For Example, Compute group sums ormeans
                         
                  
    b. Transformation   :   It is a process in which we perform some group-specific computations and return a like-indexed.
    
                            For Example, Filling NAs within groups with a value derived from each group
                            
                            Transform method returns an object that is indexed the same (same size) as the one being grouped. 
                            
                            The transform function must:

                                   -  Return a result that is either the same size as the group chunk

                                   -  Operate column-by-column on the group chunk

                                   -  Not perform in-place operations on the group chunk.
                         
                     
    c. Filtration       :   It is a process in which we discard some groups, according to a group-wise computation that 
    
                            evaluates True or False. For Example, Filtering out data based on the group sum or mean

### a. Aggregation

In [38]:
import numpy as np

In [39]:
# performing aggregation using aggregate method 
  
grp = df1.groupby('Name') 
  
grp.aggregate(np.sum)

        Age
Name
Abhi     32
Anuj     60
Gaurav   33
Jai      49
Princi   59

In [40]:
# performing aggregation on group containing multiple keys

grp1 = df1.groupby(['Name', 'Qualification']) 
  
grp1.aggregate(np.sum)

                      Age
Name   Qualification
Abhi   MA              32
Anuj   B.com           36
       MA              24
Gaurav B.Tech          33
Jai    MCA             22
       Msc             27
Princi Msc             27
       Phd             32

#### Applying multiple functions at once :
#### We can apply a multiple functions at once by passing a list or dictionary of functions to do aggregation with, outputting a DataFrame.

In [41]:
# applying a function by passing a list of functions 
  
grp = df1.groupby('Name') 
  
grp['Age'].agg([np.sum, np.mean, np.std])

        sum  mean       std
Name
Abhi     32  32.0       NaN
Anuj     60  30.0  8.485281
Gaurav   33  33.0       NaN
Jai      49  24.5  3.535534
Princi   59  29.5  3.535534

#### Applying different functions to DataFrame columns :
#### In order to apply a different aggregation to the columns of a DataFrame, we can pass a dictionary to aggregate .

In [43]:
# Define a dictionary containing employee data

data3 = {'Name':['Jai', 'Anuj', 'Jai', 'Princi',  
                 'Gaurav', 'Anuj', 'Princi', 'Abhi'],  
        'Age':[27, 24, 22, 32,  
               33, 36, 27, 32],  
        'Address':['Nagpur', 'Kanpur', 'Allahabad', 'Kannuaj', 
                   'Jaunpur', 'Kanpur', 'Allahabad', 'Aligarh'],  
        'Qualification':['Msc', 'MA', 'MCA', 'Phd', 
                         'B.Tech', 'B.com', 'Msc', 'MA'], 
        'Score': [23, 34, 35, 45, 47, 50, 52, 53]}

In [44]:
# Convert the dictionary into DataFrame   
df3 = pd.DataFrame(data3) 
   
print(df3)

     Name  Age    Address Qualification  Score
0     Jai   27     Nagpur           Msc     23
1    Anuj   24     Kanpur            MA     34
2     Jai   22  Allahabad           MCA     35
3  Princi   32    Kannuaj           Phd     45
4  Gaurav   33    Jaunpur        B.Tech     47
5    Anuj   36     Kanpur         B.com     50
6  Princi   27  Allahabad           Msc     52
7    Abhi   32    Aligarh            MA     53

In [45]:
# using different aggregation function by passing dictionary to aggregate 

grp2 = df3.groupby('Name') 
  
grp2.agg({'Age' : 'sum', 'Score' : 'std'})

        Age      Score
Name
Abhi     32        NaN
Anuj     60  11.313708
Gaurav   33        NaN
Jai      49   8.485281
Princi   59   4.949747

### b. Transformation

In [46]:
# using transform function 

grp2 = df3.groupby('Name') 
sc = lambda x: (x - x.mean()) / x.std()*10
grp2.transform(sc)

        Age     Score
0  7.071068 -7.071068
1 -7.071068 -7.071068
2 -7.071068  7.071068
3  7.071068 -7.071068
4       NaN       NaN
5  7.071068  7.071068
6 -7.071068  7.071068
7       NaN       NaN

### c. Filtration

In [47]:
# filtering data using filter data

grp2 = df3.groupby('Name') 
grp2.filter(lambda x: len(x) >= 2)

     Name  Age    Address Qualification  Score
0     Jai   27     Nagpur           Msc     23
1    Anuj   24     Kanpur            MA     34
2     Jai   22  Allahabad           MCA     35
3  Princi   32    Kannuaj           Phd     45
5    Anuj   36     Kanpur         B.com     50
6  Princi   27  Allahabad           Msc     52